package 语言基础;

public class 运算符 {
	
	/**
	 * 运算符 优先级
	 * 1、括号			()
	 * 2、正负号			+,—
	 * 3、一元运算符		++,--,!
	 * 4、乘除			*,/
	 * 5、加减			+,-
	 * 6、位移运算		>>,>>>,<<
	 * 7、比较大霄		<,>,<=,>=
	 * 8、比较是否相等	==,!=
	 * 9、按位与运算		&
	 * 10、按位异或运算	^
	 * 11、按位或运算		|
	 * 12、逻辑与运算		&&
	 * 13、逻辑或运算		||
	 * 14、三元运算符		?:
	 * 15、赋值运算符		=
	 * 
	 * */
	
	/**
	 * % 运算符
	 * 作用: 求余数
	 * 例如  199 % 5;
	 * 199 / 5, 3 * 5 = 15, 剩 49, 9 * 5 = 45, 余 4
	 * :
	 *    39
	 * 5 199
	 *   15
	 *    49
	 *    45
	 *   余4
	 *   
	 *   
	 * 199 / 5 = 39.8
	 * 199 % 5 = 4
	 */
	

	@SuppressWarnings("unused")
	public static void main(String[] args) {
		
		// 赋值运算符
		int a,b,c;
		a = 15;  // 将15赋值给变量a
		b = c = a + 5;// 将a + 5 的值赋值给变量b, c   ,java中允许把赋值运算符一起使用
		
		
		// 自增和自减运算符
		b = a++;// 先赋值,先把b=a,再a+1, a++要在下一行代码才生效
		b = ++a;// 先自加,a+1后再赋值给b, ++a在当前行生效
		
		// 位移运算符
		// java中位移运算符有3种,其操作的数据类型只有byet,short,char,int,long,5种
		int y = 4;
		y = y << 3;// 一个数左移n位，就是y*2的n次方
		y = y >> 2;// 一个数右移n位，就是y/2的n次方
		
		/*
		 * 不实用* 用位移算出21*16的值
		 * */
		System.out.println("21 * 16 = 21 << 4 = " + (21 << 4));// 2的4次方是16, 位移数只为2的次方数
		
		
		// 三元运算符
		boolean bl = 20 < 45 ? true : false;
		// -- 等同于以下判断
		if(20 < 45){
			bl = true;
		}else {
			bl = false;
		}
		
		// 嵌套三元运算符 ， 也等同于嵌套if
		boolean bl2 = 100 > 90 || 100 > 110 ? 7 > 6 ? true : false : false; 
		if(100 > 90 || 100 > 110){
			if(7 > 6){
				bl2 = true;
			}else {
				bl2 = false;
			}
		}
	}
}
